Revit 2024 API
BarTypeDiameterOptions Members
The BarTypeDiameterOptions type exposes the following members.
Constructors
Name | Description
BarTypeDiameterOptions()
 Constructs a new BarTypeDiameterOptions with default settings.
BarTypeDiameterOptions(RebarBarType)
 Constructs a new BarTypeDiameterOptions copying the diameter information from the bar type.
Methods
Name | Description
Dispose
Releases all resources used by the BarTypeDiameterOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
BarModelDiameter
 Represents the bar model diameter of the RebarBarType.
BarNominalDiameter
 Represents the bar nominal diameter of the RebarBarType.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
StandardBendDiameter
 Represents the standard bar bend diameter of the RebarBarType.
StandardHookBendDiameter
 Represents the standard hook bend diameter of the RebarBarType.
StirrupTieBendDiameter
 Represents the stirrup/tie bar and hook bend diameter of the RebarBarType.
See Also
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace